var MemoryStore = function(successCallback, errorCallback) {

	this.findByNameWithFilter = function(searchKey,filterId,callback) {
		
			var items = (function(keyStr, items){
				jQuery.each(keyStr.split("+"), function(index, item) {
					items = items.filter(function(element) {
						var searhString = element.name +""+ element.cat1 +""+element.formula+""+element.symptom;
						return searhString.toLowerCase().indexOf(item.toLowerCase()) > -1;
					});
				});
				return items;
			})(searchKey,window.sources);
			
				
			if(filterId!=""){
				var filterList=window.filterList;
				var filterString=filterList[filterId].content;
				console.log(filterString);
				items = items.filter(function(element) {
					if(filterString!=""){
						return filterString.toLowerCase().indexOf(element.name.toLowerCase())>-1;
					}else{
						return false;
					}
				});
			}
			
			callLater(callback, items);

    }
	

    this.findById = function(id, callback) {
        var items = window.sources;
        var item = null;
        var l = items.length;
		console.log(id);
        for (var i=0; i < l; i++) {
            if (items[i].id === id) {
                item = items[i];
                break;
            }
        }
        callLater(callback, item);
    }
	
	this.findAll = function(callback){
		var items=window.sources;
		var clean_list=[];
		for (var i=0;i<items.length;i++){
			
			var obj={c_name:items[i].cat1};
			var existflag=false;
			for(var j=0;j<clean_list.length;j++){
				if(clean_list[j].c_name==obj.c_name){
					existflag=true;
					break;
				}
			}
			
			if(existflag==false){
				clean_list.push(obj);
			}
		}
		
		callLater(callback,clean_list);
	}
	
	//filter list
	this.findFilterById = function(id,callback){
		var filterList= window.filterList;
		var fItem = null;
		var l = filterList.length;
        for (var i=0; i < l; i++) {
            if (filterList[i].id === id) {
                fItem = filterList[i];
                break;
            }
        }
        callLater(callback, fItem);
	}
	
	this.findAllFilter = function(callback){
		var filterList= window.filterList;
        callLater(callback, filterList);
	}
	

    // Used to simulate async calls. This is done to provide a consistent interface with stores (like WebSqlStore)
    // that use async data access APIs
    var callLater = function(callback, data) {
        if (callback) {
            setTimeout(function() {
                callback(data);
            });
        }
    }
	
	window.filterList=[
			//{"id":0,"selected":0,"title":"30个考试穴位","content":"下关 尺泽 少冲 翳风 腰阳关 血海 丘墟 丰隆 外劳宫 耳门 曲泽 肩髎 颊车 公孙 少泽 梁门 中府 风池 条口 章门 合谷 梁丘 后溪 申脉 气海 中脘 太渊 印堂 百会 地仓 昆仑"}
	];

	window.sources = [
{"id":"1","name":"桂枝汤","formula":"桂枝9克，芍药9克，甘草（炙）6克，生姜（切）9克，大枣（擘）4枚","cat1":"桂枝汤证","symptom":"发热、恶风、汗(+)、头痛、颈痛、浮弱"},
{"id":"2","name":"桂枝加桂汤","formula":"桂枝15克，芍药9克，生姜（切）9克，甘草（炙）6克，大枣（擘）4枚","cat1":"桂枝汤证","symptom":"发热、恶风、汗(+)、头痛、颈痛、气上冲、浮弱、热证(-)、神经官能症、冠心病心律失常"},
{"id":"3","name":"桂枝加芍药汤","formula":"桂枝9克，芍药18克，生姜（切）9克，甘草（炙）6克，大枣（擘）4枚","cat1":"桂枝汤证","symptom":"发热、恶风、汗(+)、头痛、颈痛、腹痛、腹满、腹拘急、浮弱、里实(-)"},
{"id":"4","name":"桂枝加大黄汤","formula":"桂枝9克，芍药18克，生姜9克，甘草（炙）6克，大枣（擘）4枚，大黄6克","cat1":"桂枝汤证","symptom":"发热、恶风、汗(+)、头痛、颈痛、腹痛、大便不通浮弱、里实(++)"},
{"id":"5","name":"桂枝加葛根汤","formula":"桂枝9克，芍药9克，生姜9克，甘草（炙）9克，大枣（擘）4枚，葛根12克","cat1":"桂枝汤证","symptom":"发热、恶风、汗(+)、头痛、颈痛、项背强急俯仰转侧不能自如、浮弱"},
{"id":"6","name":"栝楼桂枝汤","formula":"栝楼根9克，桂枝10克，白芍10克，生姜10克，大枣4枚，炙甘草6克","cat1":"桂枝汤证","symptom":"发热、恶寒(-)、汗(+)、头痛、颈痛、全身痉挛拘急、沉迟"},
{"id":"7","name":"桂枝加黄耆汤","formula":"桂枝10克，白芍10克，生姜10克，大枣4枚，炙甘草6克，黄耆10克","cat1":"桂枝汤证","symptom":"发热、恶风(++)、汗(++)、黄汗、头痛、颈痛、身痛黄疸、浮弱"},
{"id":"8","name":"黄耆芍药桂枝苦酒汤","formula":"黄耆15克，芍药9克，桂枝9克， 米醋30克","cat1":"桂枝加黄耆汤证","symptom":"恶风、汗(+)、黄汗、头痛、颈痛、身痛口渴(+)"},
{"id":"9","name":"桂枝加附子汤","formula":"桂枝10克，芍药9克，甘草（炙）9克，生姜〔切）9克，大枣（擘）4枚，炮附子6～12克","cat1":"桂枝汤证","symptom":"发热、恶寒、汗(+)、头痛、颈痛、四肢微急小便不利、浮弱"},
{"id":"10","name":"桂枝加芍药生姜各一两人参三两新加汤","formula":"桂枝9克，芍药12克，生姜12克，大枣4枚，甘草（炙）6克，人参9克","cat1":"桂枝汤证","symptom":"发热、恶风、汗(+)、头痛、颈痛、身痛(++)、沉迟、胃气虚"},
{"id":"11","name":"桂枝加厚朴杏子汤","formula":"桂枝9克，芍药9克，生姜9克，甘草（炙）6克，大枣4枚，厚朴6克，杏仁6克","cat1":"桂枝汤证","symptom":"发热、恶风、汗(+)、头痛、颈痛、咳、喘、浮弱"},
{"id":"12","name":"桂枝加龙骨牡蛎汤","formula":"桂枝9克，芍药9克，生姜9克，炙甘草6克，大枣4枚，生龙骨9克，牡蛎9克","cat1":"桂枝汤证","symptom":"发热、恶风、汗(+)、头痛、颈痛、心悸、遗精、不安、多梦、浮弱"},
{"id":"13","name":"小建中汤","formula":"桂枝9克，芍药18克，生姜9克，炙甘草6克，大枣4枚，饴糖45克（分冲）","cat1":"桂枝汤证","symptom":"发热、恶风、汗(+)、头痛、颈痛、腹痛、腹拘急、心悸、呕(-)浮涩沉弦、实热(-)"},
{"id":"14","name":"当归建中汤","formula":"桂枝9克，芍药18克，生姜9克，炙甘草6克，大枣4枚，当归12克 。若大虚加胶饴45克（分冲）。若出血过多，崩伤内衄不止，加地黄18克，阿胶6克。","cat1":"桂枝汤证","symptom":"发热、恶风、汗(+)、头痛、颈痛、浮弱、血虚(++)"},
{"id":"15","name":"黄耆建中汤","formula":"桂枝9克，芍药18克，生姜10克，大枣4枚，炙甘草6克，黄耆9克，饴糖45克（分冲）","cat1":"小建中汤证","symptom":"发热、恶风(++)、汗(++)、头痛、颈痛、腹痛、腹拘急、呕(-)、小便利黄疸、浮弱"},
{"id":"16","name":"黄耆桂枝五物汤","formula":"桂枝9克，芍药9克，生姜18克，大枣4枚，黄耆9克","cat1":"桂枝加黄耆汤证","symptom":"肢体麻木不仁、虚弱、表里俱虚、慢性病神经麻痹症"},
{"id":"17","name":"桂枝去芍药汤","formula":"桂枝9克，生姜9克，大枣4枚，炙甘草6克","cat1":"桂枝汤证","symptom":"发热、恶风、汗(+)、胸满、寸浮、关尺沉、感冒发热后表症(-)"},
{"id":"18","name":"桂枝去芍药加附子汤","formula":"桂枝9克，生姜9克，大枣4枚，炙甘草9克，炮附子3克","cat1":"桂枝去芍药汤证","symptom":"发热、恶寒(++)、汗(+)、胸满、细、风湿、类风湿"},
{"id":"19","name":"桂枝附子汤","formula":"桂枝l2克，附子（炮）9克，生姜9克，大枣4枚，炙甘草6克","cat1":"桂枝去芍药加附子汤证","symptom":"关节痛、虚、虚寒、风湿"},
{"id":"20","name":"去桂加白朮汤","formula":"附子（炮）9克，生姜9克，大枣4枚，炙甘草6克，白朮12克","cat1":"桂枝附子汤证","symptom":"关节痛、气上冲(-)小便利、大便干虚、虚寒、老年体虚风湿"},
{"id":"21","name":"桂枝去芍药加茯苓白朮汤","formula":"桂枝9克，生姜9克，大枣4枚，炙甘草6克，茯苓9克，白朮9克","cat1":"桂枝去芍药汤证","symptom":"发热、恶风、汗(-)、头痛、颈痛、身痛、胸满小便不利、寸浮、关尺沉、外邪内饮"},
{"id":"22","name":"甘草附子汤","formula":"炙甘草9克，炮附子9克，白朮9克，桂枝12克","cat1":"桂枝附子汤证","symptom":"恶风、汗(+)、关节痛(++)、 短气小便不利浮肿寒湿"},
{"id":"23","name":"桂枝去芍药加皂荚汤","formula":"桂枝9克，生姜9克，大枣4枚，炙甘草6克，皂荚(去皮子，炙焦)6克","cat1":"桂枝去芍药汤证","symptom":"发热、恶风、汗(+)、胸满、痰涎(++)、寸浮、关尺沉、肺冷、虚热(-)"},
{"id":"24","name":"桂枝救逆汤 / 桂枝去芍药加蜀漆牡蛎龙骨汤救逆汤","formula":"桂枝9克，生姜9克，大枣4枚，炙甘草6克，蜀漆(去腥)9克，牡蛎15克，龙骨12克","cat1":"桂枝去芍药汤证","symptom":"发热、恶风、汗(+)、胸满、惊狂、不安寸浮、关尺沉、痰饮(++)"},
{"id":"25","name":"桂枝甘草汤","formula":"桂枝36克，炙甘草18克","cat1":"桂枝汤证","symptom":"发热、恶风、汗(+)、气上冲、心悸、手自压心窝里实(-)"},
{"id":"26","name":"半夏散及汤","formula":"半夏、桂枝、炙甘草，各等分","cat1":"桂枝甘草汤证","symptom":"发热、恶风、汗(+)、气上冲、心悸、手自压心窝、咽痛(++)、痰涎(++)口渴(-)里实(-)"},
{"id":"27","name":"桂枝甘草龙骨牡蛎汤","formula":"桂枝12克，炙甘草6克，龙骨6克，牡蛎6克","cat1":"桂枝去芍药加蜀漆牡蛎龙骨汤救逆汤证","symptom":"发热、恶风、汗(+)、胸满、心烦、心悸、惊狂寸浮、关尺沉、痰饮"},
{"id":"28","name":"桂枝人参汤","formula":"桂枝12克，炙甘草12克，白朮9克，人参9克，干姜9克","cat1":"桂枝甘草汤证+理中汤证","symptom":"发热、恶风、汗(+)、气上冲、心悸、手自压心窝、心下痞小便少、大便溏泻、表里不解"},
{"id":"29","name":"苓桂朮甘汤","formula":"茯苓12克，桂枝9克，白朮9克，炙甘草6克","cat1":"桂枝甘草汤证","symptom":"发热、恶风、汗(+)、气上冲、心悸、心下痞满、头晕、短气小便不利、沉紧、实热(-)"},
{"id":"30","name":"苓桂枣甘汤","formula":"茯苓24克，桂枝12克，大枣4枚，炙甘草6克","cat1":"桂枝甘草汤证","symptom":"发热、恶风、汗(+)、气上冲(++)、心下脐下悸动、腹挛急"},
{"id":"31","name":"茯苓甘草汤","formula":"茯苓9克，炙甘草3克，生姜9克，桂枝6克","cat1":"桂枝甘草汤证","symptom":"发热、恶风、汗(+)、气上冲、心悸、手自压心窝、呕(+)、口渴(-)失眠"},
{"id":"32","name":"茯苓泽泻汤","formula":"茯苓24克，泽泻12克，炙甘草6克，桂枝6克，白朮9克，生姜12克","cat1":"茯苓甘草汤证","symptom":"发热、恶风、汗(+)、气上冲、心悸、手自压心窝、心下痛、呕(++)、口渴(+)痰饮(++)"},
{"id":"33","name":"苓桂五味甘草汤","formula":"茯苓12克，桂枝12克，五味子12克，炙甘草9克","cat1":"桂枝甘草汤证","symptom":"发热、恶风、汗(+)、气上冲、心悸、手自压心窝、咳逆上气、眩晕(++)小便不利手足厥冷、寸沉、尺微、外邪内饮"},
{"id":"34","name":"苓甘五味姜辛汤","formula":"茯苓12克，炙甘草9克，干姜9克，细辛9克，五味子14克","cat1":"苓桂五味甘草汤证","symptom":"发热(-)、恶寒(-)咳、胸满、痰白口渴(-)痰饮、慢性咳喘"},
{"id":"35","name":"苓甘五味姜辛夏汤","formula":"茯苓12克，炙甘草6克，细辛6克，干姜6克，五味子14克，半夏15克","cat1":"苓甘五味姜辛汤证","symptom":"发热(-)、恶寒(-)咳、胸满、吐稀白痰、头晕、呕(+)、口渴(-)痰饮(++)、寒(++)"},
{"id":"36","name":"苓甘五味姜辛夏杏汤","formula":"茯苓12克，炙甘草9克，细辛9克，五味子14克，干姜9克，半夏15克，杏仁15克","cat1":"苓甘五味姜辛夏汤证","symptom":"发热(-)、恶寒(-)咳、胸满、吐稀白痰、头晕、呕(+)、头面四肢浮肿口渴(-)"},
{"id":"37","name":"苓甘五味姜辛夏杏大黄汤","formula":"茯苓12克，炙甘草9克，五味子14克，干姜9克，细辛9克，半夏15克，杏仁15克，大黄6克","cat1":"苓甘五味姜辛夏杏汤证","symptom":"上热、恶寒(-)咳、胸满、吐稀白痰、头晕、呕(+)大便难、面色如醉状、头面四肢浮肿口渴(-)慢性支气管炎"},
{"id":"38","name":"五苓散","formula":"桂枝6克，泽泻15克，茯苓9克，猪苓9克，白朮9克","cat1":"其他","symptom":"发热、恶风、汗(+)、头痛、颈痛、心下停饮、气上冲、水入则吐(++)、小便不利口渴(++)、浮、外邪内饮"},
{"id":"39","name":"风引汤","formula":"桂枝10克 ，甘草6克，牡蛎6克 ，大黄12克，干姜12克 ，龙骨12克，  寒水石18克，滑石18克，赤石脂18克，白石脂18克，紫石脂18克，石膏18克","cat1":"其他","symptom":"发热(-)、恶寒(-)癫痫、中风偏瘫热证"},
{"id":"40","name":"防己地黄汤","formula":"生地黄100克，防己3克，桂枝10克，防风10克，甘草6克","cat1":"其他","symptom":"发热(-)、恶寒(-)、病如狂状、妄行、独语不休浮"},
{"id":"41","name":"蜘蛛散","formula":"蜘蛛14枚(熬焦)，桂枝3克","cat1":"其他","symptom":"阴狐疝气、偏有小大、时时上下无痛苦能自复之疝气"},
{"id":"42","name":"竹皮大丸","formula":"生竹茹0.6克， 石膏0.6克， 桂枝0.3克， 甘草2.1克， 白薇0.3克，有热者加白薇0.3克，烦喘者加柏实0.3克","cat1":"其他","symptom":"发热心烦、呕(+)大便难(-)、抽搐(-)、产后、里实(-)"},
{"id":"43","name":"麻黄汤","formula":"麻黄（去节）9克，桂枝6克，甘草(炙)3克，杏仁（去皮尖）9克","cat1":"麻黄汤证","symptom":"发热、恶风、汗(-)、头痛、身痛、腰痛、关节疼痛、喘、呕(+)、鼻衂、浮紧"},
{"id":"44","name":"麻黄加朮汤","formula":"麻黄9克，桂枝6克，炙甘草3克，杏仁9克，白朮12克","cat1":"麻黄汤证","symptom":"发热、恶风、汗(-)、头痛、身痛、腰痛、关节疼痛、喘、呕(+)浮紧、湿痹、风湿关节炎"},
{"id":"45","name":"麻黄杏仁薏苡甘草汤","formula":"麻黄9克，薏苡仁18克，杏仁6克，炙甘草6克","cat1":"麻黄汤证","symptom":"发热、午后(++)周身关节痛、身重浮肿表里挟湿、急性风湿关节炎"},
{"id":"46","name":"麻杏甘石汤","formula":"麻黄18克，杏仁9克，炙甘草9克，石膏45～100克","cat1":"麻黄汤证","symptom":"发热、恶风(-)、汗(+)、黏稠量多臭味重、喘、心烦、胸满口干(+)外邪内热、气管炎、肺炎、 哮喘"},
{"id":"47","name":"越婢汤","formula":"麻黄18克，石膏45～100克，生姜9克，炙甘草6克，大枣5枚","cat1":"麻杏甘石汤证","symptom":"发热、恶风、汗(+)、周身浮肿口渴(-)、浮、风水、外邪内热"},
{"id":"48","name":"越婢加朮汤","formula":"麻黄18克，石膏45～100克，生姜9克，炙甘草6克，大枣5枚，白朮12克","cat1":"越婢汤证","symptom":"发热、恶风、汗(+)、身痛、关节痛小便不利周身面目浮肿、微发黄色口渴(-)、沉、湿痹"},
{"id":"49","name":"越婢加半夏汤","formula":"麻黄18克，生姜9克，炙甘草6克，大枣5枚，生石膏45～100克，半夏15克","cat1":"越婢汤证","symptom":"发热、恶风、汗(+)、咳、喘、头痛、两眼发胀浮肿口渴(-)、浮大、外寒内热内饮"},
{"id":"50","name":"甘草麻黄汤","formula":"甘草6克，麻黄12克","cat1":"麻黄汤证","symptom":"发热、恶风、汗(-)、浮肿有表证、里热不显"},
{"id":"51","name":"麻黄附子甘草汤","formula":"麻黄6克，炙甘草6克，炮附子3克","cat1":"甘草麻黄汤证","symptom":"恶寒、汗(-)、头痛、但欲寐微细、表虚寒"},
{"id":"52","name":"麻黄附子汤","formula":"麻黄9克，炙甘草6克，炮附子3克","cat1":"麻黄附子甘草汤证","symptom":"恶寒、汗(-)、头痛浮肿(++)、但欲寐沉小、虚寒"},
{"id":"53","name":"麻黄附子细辛汤","formula":"麻黄6克，细辛6克，炮附子3克","cat1":"麻黄附子甘草汤证","symptom":"发热、恶寒、汗(-)、头痛、但欲寐沉、表虚寒兼寒饮、感冒、急慢性气管炎、关节炎"},
{"id":"54","name":"葛根汤","formula":"葛根12克，麻黄9克，桂枝6克，生姜9克，芍药6克，炙甘草6克，大枣4枚","cat1":"桂枝加葛根汤证","symptom":"发热、恶风、汗(-)、头痛、颈痛、项背强急俯仰转侧不能自如、喘、下利浮、刚痉、疹痘初期、腰肌劳损"},
{"id":"55","name":"葛根加半夏汤","formula":"葛根12克，麻黄9克，桂枝6克，生姜9克，芍药6克，炙甘草6克，大枣4枚，半夏12克","cat1":"葛根汤证+半夏汤证","symptom":"发热、恶风、汗(-)、头痛、颈痛、项背强急俯仰转侧不能自如、喘、呕(+)下利浮"},
{"id":"56","name":"葛根黄芩黄连汤","formula":"葛根24克，炙甘草6克，黄芩9克，黄连9克","cat1":"其他","symptom":"发热、恶寒(-)、汗(+)、喘、下利浮数、内外皆热、急性胃肠型感冒、痢疾初期"},
{"id":"57","name":"葛根加生石膏汤","formula":"葛根12克，麻黄9克，桂枝6克，生姜9克，芍药6克，炙甘草6克，大枣4枚 ，生石膏45～100克","cat1":"葛根汤证","symptom":"发热、恶寒、汗(-)、头痛、颈痛、项背强急俯仰转侧不能自如、喘口干(+)、浮"},
{"id":"58","name":"葛根加桔梗汤","formula":"葛根12克，麻黄9克，桂枝6克，生姜9克，芍药6克，炙甘草6克，大枣4枚 ，桔梗9克","cat1":"葛根汤证","symptom":"发热、恶寒、汗(-)、头痛、颈痛、项背强急俯仰转侧不能自如、喘、咽痛、排痰困难、浮"},
{"id":"59","name":"葛根加薏苡仁汤","formula":"葛根12克，麻黄9克，桂枝6克，生姜9克，芍药6克，炙甘草6克，大枣4枚 ，薏苡仁15～30克","cat1":"葛根汤证","symptom":"发热、恶寒、汗(-)、头痛、颈痛、项背强急俯仰转侧不能自如、喘、关节痛痈脓、浮"},
{"id":"60","name":"葛根加朮附汤","formula":"葛根12克，麻黄9克，桂枝6克，生姜9克，芍药6克，炙甘草6克，大枣4枚 ，白朮10克，附子10克","cat1":"葛根汤证","symptom":"发热、恶寒、汗(-)、头痛、颈痛、项背强急俯仰转侧不能自如、喘、关节痛、心烦、腰背拘急痛、浮"},
{"id":"61","name":"葛根加苓朮附汤","formula":"葛根12克，麻黄9克，桂枝6克，生姜9克，芍药6克，炙甘草6克，大枣4枚 ，白朮10克，附子10克，茯苓10克","cat1":"葛根加朮附汤","symptom":"发热、恶寒、汗(-)、头痛、颈痛、项背强急俯仰转侧不能自如、喘、关节痛、心烦、腰背拘急痛小便不利、浮"},
{"id":"62","name":"桂枝麻黄各半汤","formula":"桂枝5克，芍药3克，生姜3克，炙甘草3克，麻黄3克，杏仁3克，大枣2枚","cat1":"桂枝汤证+麻黄汤证","symptom":"发热(++)、恶寒、汗(-)、身痒、微缓、感冒发热病后期、慢性病复感外邪"},
{"id":"63","name":"桂枝二麻黄一汤","formula":"麻黄3克，桂枝6克，芍药6克，生姜6克，炙甘草4克，杏仁3克，大枣2枚","cat1":"桂枝汤证+麻黄汤证","symptom":"发热、恶风、汗(+)、头痛、颈痛、身痛、腰痛、关节疼痛、喘、呕(+)浮、桂枝汤证多、麻黄汤证少"},
{"id":"64","name":"桂枝二越婢一汤","formula":"桂枝3克，芍药3克，麻黄3克，炙甘草3克，大枣2枚，生姜5克，石膏5克","cat1":"桂枝汤证+越婢汤证","symptom":"发热、恶寒、汗(-)、头痛、颈痛、烦躁浮肿口干(+)、微弱、桂枝汤证多、越婢汤证少"},
{"id":"65","name":"大青龙汤","formula":"麻黄18克，桂枝6克，炙甘草6克，杏仁6克，生姜9克，大枣4枚，生石膏45～100克","cat1":"麻黄汤证+越婢汤证","symptom":"发热、恶风、汗(-)、头痛、身痛、腰痛、关节疼痛、喘、烦躁、呕(+)、小便不利浮肿口渴(-)、浮紧、阳热、肾炎重症"},
{"id":"66","name":"文蛤汤","formula":"文蛤15克，麻黄9克，炙甘草9克，生姜9克，生石膏15克，杏仁9克，大枣4枚","cat1":"麻杏甘石汤证+越婢汤证","symptom":"发热、恶风、汗(+)、喘、烦满浮肿口渴(++)、浮、外邪内热"},
{"id":"67","name":"小青龙汤","formula":"麻黄9克，芍药9克，细辛9克，干姜9克，炙甘草9克，桂枝9克，五味子12克，半夏15克","cat1":"小青龙汤证","symptom":"发热、恶寒心下有水气、少腹满、噎、咳、喘、呕(+)、小便不利、下利、口渴(+)不得卧外邪内饮、慢性虚寒性咳嗽"},
{"id":"68","name":"小青龙加石膏汤","formula":"麻黄9克，芍药9克，细辛9克，干姜9克，炙甘草9克，桂枝9克，五味子12克，半夏15克，石膏30～60克","cat1":"小青龙汤证","symptom":"发热、恶寒心下有水气、少腹满、噎、咳、喘、烦躁、呕(+)、小便不利、下利、口渴(+)不得卧、浮、外邪内饮、热壅气逆"},
{"id":"69","name":"射干麻黄汤","formula":"射干9克，麻黄12克，生姜12克，细辛9克，紫菀9克，款冬花9克，五味子13克，大枣3枚，半夏15克(口干、烦躁加生石膏)","cat1":"小青龙汤证","symptom":"发热、恶寒心下有水气、少腹满、噎、咳、喘、喉中痰鸣(++)、呕(+)、小便不利、下利、口渴(+)不得卧外邪内饮"},
{"id":"70","name":"厚朴麻黄汤","formula":"厚朴15克，麻黄12克，石膏30-60克，杏仁15克，半夏15克，干姜6克，细辛6克，浮小麦30克，五味子14克","cat1":"小青龙加石膏汤证","symptom":"发热、恶寒心下有水气、少腹满、噎、咳、喘、烦躁、胸满、短气、呕(+)、小便不利、下利、口渴(+)不得卧、浮、外邪内饮"},
{"id":"71","name":"桂枝去芍药加麻黄附子细辛汤","formula":"桂枝9克，生姜9克，炙甘草6克，大枣4枚，麻黄6克，细辛6克，炮附子3克","cat1":"桂枝去芍药汤证+麻黄附子细辛汤证","symptom":"恶寒身痛、麻痹、腹胀手足逆冷、但欲寐"},
{"id":"72","name":"麻黄连翘赤小豆汤","formula":"麻黄6克，生姜6克，生梓白皮15克，连翘6克，炙甘草6克，大枣4枚，赤小豆30克，杏仁6克","cat1":"麻黄汤证","symptom":"发热、恶风、汗(-)、身痒黄疸、身黄、目黄瘀热在里发黄、皮肤湿疹、瘙痒"},
{"id":"73","name":"续命汤","formula":"麻黄6克，桂枝6克，人参6克，甘草6克，干姜6克，石膏6克，当归6克，杏仁6克，川芎3克","cat1":"麻黄加石膏汤证","symptom":"发热、恶风身痛拘急不得转侧、麻木肢体不遂、语言不利、茫然不知痛中虚、血少、脑血管病、身痹痛有表证"},
{"id":"74","name":"桂枝芍药知母汤","formula":"桂枝12克，芍药9克，甘草6克，麻黄6克，生姜15克，白朮15克，知母12克，防风12克，炮附子6克(风湿热加石膏)","cat1":"桂枝汤证","symptom":"关节疼痛、气上冲、呕(+)、身瘦、肢体肿慢性关节炎下肢腕指关节肿痛"},
{"id":"75","name":"三黄汤","formula":"麻黄8克，独活6克，细辛3克，黄耆3克，黄芩5克","cat1":"其他","symptom":"恶寒、汗(-)、关节疼痛、手足拘急、烦热、不欲饮食"},
{"id":"76","name":"牡蛎汤","formula":"牡蛎12克，麻黄12克，甘草6克，蜀漆9克","cat1":"甘草麻黄汤证","symptom":"发热、恶寒(++)、汗(-)、疟疾、身痛、胸腹悸动浮肿外寒内饮成痞坚"},
{"id":"77","name":"麻黄升麻汤","formula":"麻黄8克，升麻4克，当归4克，知母3克，黄芩3克，玉竹3克，芍药1克，天门冬1克，桂枝1克，茯苓1克，炙甘草1克，生石膏1克，白朮1克，干姜1克","cat1":"其他","symptom":"上热下寒咽喉不利、下利、手足逆冷、沉迟、伤寒表里不解、寒热虚实交错"},
{"id":"78","name":"半夏麻黄丸","formula":"半夏、麻黄等分","cat1":"其他","symptom":"发热、恶风、汗(-)、心下悸浮肿胃中有水气"},
{"id":"79","name":"升麻鳖甲汤","formula":"升麻18克，当归9克，蜀椒9克（炒，去汗），甘草18克，鳖甲手掌大一片，雄黄5克（研）","cat1":"其他","symptom":"咽喉肿痛身面红肿痈脓急性温疫"},
{"id":"80","name":"升麻鳖甲汤去雄黄蜀椒汤","formula":"升麻18克，当归9克，甘草18克，鳖甲手掌大1片","cat1":"升麻鳖甲汤证","symptom":"发热(-)、恶寒(-)咽喉肿痛、身痛(++)、吐脓血(-)面目青"},
{"id":"81","name":"千金麻黄醇酒汤","formula":"麻黄10克，冬月酒煮，春月水煮","cat1":"其他","symptom":"发热、恶寒、汗(-)、黄疸口渴(-)里热(-)"},
{"id":"82","name":"大承气汤","formula":"大黄12克，厚朴18克，枳实9克，芒硝18克","cat1":"大承气汤证","symptom":"恶寒(-)、潮热、汗(+)、手足汗(+)、腹满痛、心烦、不能食大便难谵语迟、里实热"},
{"id":"83","name":"小承气汤","formula":"大黄12克，厚朴9克，枳实9克","cat1":"大承气汤证","symptom":"潮热(-)腹胀满、大便硬、大便不通时间不久、胃中燥"},
{"id":"84","name":"调胃承气汤","formula":"大黄10克，炙甘草6克，芒硝12克（分冲）","cat1":"大承气汤证","symptom":"发热心烦、谵语、腹实"},
{"id":"85","name":"大黄甘草汤","formula":"大黄9克，炙甘草6克","cat1":"调胃承气汤证","symptom":"、呕(+)大便难而急迫、燥结(-)、胃肠热(-)"},
{"id":"86","name":"厚朴三物汤 / 厚朴大黄汤","formula":"大黄9克，厚朴18克，枳实11克","cat1":"小承气汤证","symptom":"潮热(-)胸腹胀满疼痛(++)、大便闭结、大便不通时间不久、胃中燥"},
{"id":"87","name":"厚朴七物汤","formula":"厚朴15克，枳实9克，大黄6克，桂枝5克，生姜9克，大枣3枚，甘草6克","cat1":"厚朴三物汤证+桂枝去芍药汤证","symptom":"发热、恶寒(-)腹满、大便干结浮"},
{"id":"88","name":"麻子仁丸","formula":"麻子仁30克，芍药24克，枳实24克，大黄18克，厚朴24克，杏仁18克","cat1":"小承气汤证","symptom":"、大便难、但无所苦、里实热、习惯性、老年、虚人便秘"},
{"id":"89","name":"白虎汤","formula":"知母18克，生石膏45-100克，炙甘草6克，粳米30克","cat1":"白虎汤证","symptom":"发热(++)、汗(+)、口干(+)、滑数"},
{"id":"90","name":"白虎加人参汤","formula":"知母18克，石膏60～100克，炙甘草6克，粳米30克，人参9克","cat1":"白虎汤证","symptom":"发热、恶风、汗(++)、烦口渴(++)、欲饮水、洪大"},
{"id":"91","name":"白虎加桂枝汤","formula":"知母18克，生石膏30-100克，炙甘草6克，粳米30克 ，桂枝9克","cat1":"桂枝甘草汤证+白虎汤证","symptom":"发热、恶寒(-)、汗(+)、关节痛、心烦、呕(+)、里实(-)"},
{"id":"92","name":"下瘀血汤","formula":"大黄27克，桃仁20枚，蟅虫20枚（熬，去足）","cat1":"其他","symptom":"脐下少腹硬满痛(++)、大便干结产后腹痛、经血不利、瘀血(++)"},
{"id":"93","name":"桃核承气汤","formula":"桃仁9克，大黄12克，桂枝6克，炙甘草6克，芒硝6克（分二煎）","cat1":"调胃承气汤证","symptom":"发热腹痛有定处、气上冲、如狂、谵语、腹实、瘀血"},
{"id":"94","name":"大黄牡丹皮汤","formula":"大黄12克，桃仁9克，丹皮11克，冬瓜子12克，芒硝12克（分二煎）","cat1":"其他","symptom":"发热、恶寒、汗(+)、右腹痛拒按(++)、迟紧、里实热、有瘀血痈肿、急性阑尾炎脓未成"},
{"id":"95","name":"抵当汤","formula":"水蛭（熬）6克，虻虫（熬）6克，桃仁6克，大黄9克","cat1":"其他","symptom":"发热少腹硬满小便利、大便难、黄疸、经闭喜忘、狂躁不安、瘀血(++)"},
{"id":"96","name":"抵当丸","formula":"大黄27克，虻虫（熬）20个，水蛭（熬）20个，桃仁25个","cat1":"抵当汤证","symptom":"发热少腹硬满小便利、大便难、黄疸、经闭浮、瘀血"},
{"id":"97","name":"大黄蟅虫丸","formula":"大黄（蒸）8克，黄芩6克，甘草9克，桃仁24克，杏仁24克，芍药12克，干地黄30，干漆3克，虻虫40克，水蛭60克，蛴螬40克，蟅虫25克","cat1":"其他","symptom":"面目黯黑、瘀斑、肌肤甲错虚劳挟瘀"},
{"id":"98","name":"桂枝茯苓丸","formula":"桂枝、茯苓、丹皮、桃仁、芍药各等分","cat1":"其他","symptom":"腹满痛、胁痛、痛有定处、气冲、心悸肿块、下血、久瘀不宜攻下"},
{"id":"99","name":"鳖甲煎丸","formula":"鳖甲3.3克，乌扇0.9克(烧)， 黄芩0.9克， 柴胡0.9克，人参0.3克， 半夏0.3克，干姜0.9克，桂枝0.9克，芍药1.5克， 牡丹1.5克(去心)，桃仁0.6克，赤硝3.6克，大黄0.9克 ，厚朴0.9克， 瞿麦0.6克，石苇0.9克(去毛)，葶苈0.3克（熬），紫葳0.9克， 阿胶0.9克，蜂巢1.2克(炙)，蟅虫1.5克（熬)， 蜣螂1.8克(熬），鼠妇0.9克(熬）","cat1":"柴胡桂枝汤证+桃核承气汤证","symptom":"面颊瘀斑、肝脾肿大慢性肝炎、疟疾"},
{"id":"100","name":"土瓜根散","formula":"土瓜根9克，芍药9克，桂枝9克，蟅虫9克","cat1":"其他","symptom":"腹满痛、痛有定处阴囊肿大、带下、经水不利、阴肿痛、瘀血、热证"},
{"id":"101","name":"旋覆花汤","formula":"旋覆花10克，葱14茎，新绛少许","cat1":"其他","symptom":"胸闷、胸痛喜喝热水热证(-)、肝炎、神经官能症、心脏病"},
{"id":"102","name":"红蓝花酒","formula":"红蓝花(红花)10克","cat1":"其他","symptom":"腹痛、身痛、刺痛有定处"},
{"id":"103","name":"大陷胸汤","formula":"大黄18克，芒硝12克，甘遂末3克","cat1":"大陷胸汤证","symptom":"发热、汗(+)、心下结硬、满痛拒按、烦躁、沉紧、热实(++)、胸腹炎症有水、肿块、疼痛(++)"},
{"id":"104","name":"大陷胸丸","formula":"大黄24克，芒硝30克，葶苈子18克，杏仁18克","cat1":"大陷胸汤证","symptom":"项背强急、心下结硬、疼痛水多痛轻结胸"},
{"id":"105","name":"十枣汤","formula":"芫花（熬）、甘遂、大戟各等分，大枣10枚","cat1":"其他","symptom":"胸闷、胁痛、心下痞硬满、咳、沉弦、胸水、腹水"},
{"id":"106","name":"甘遂半夏汤","formula":"甘遂3克，半夏18克，芍药15克，炙甘草6克，蜜半杯","cat1":"其他","symptom":"心下坚满(++)、腹挛急、伏、腹水+心下坚满(++)"},
{"id":"107","name":"大黄甘遂汤","formula":"大黄12克，甘遂6克，阿胶6克","cat1":"其他","symptom":"少腹满痛小便不利、大便不畅产后、口渴(-)水血互结"},
{"id":"108","name":"己椒苈黄丸","formula":"防己9克，椒目9克，葶苈子（熬）9克，大黄9克，渴者加芒硝6克","cat1":"其他","symptom":"腹满、肠鸣小便不利、大便干、口干(+)胸水、腹水"},
{"id":"109","name":"小陷胸汤","formula":"黄连6克，半夏15克，栝楼30～60克","cat1":"其他","symptom":"胸膈满闷、心烦、按之心下结痛感、痰、嗽、烦热、浮滑、水热互结"},
{"id":"110","name":"葶苈大枣泻肺汤","formula":"葶苈子熬令黄色捣丸如弹子大，大枣12枚","cat1":"其他","symptom":"咳、喘、吐黄浓痰不得卧实热、咳喘、肺痈、胸膜炎"},
{"id":"111","name":"皂荚丸","formula":"皂荚24克(刮去皮，酥炙)，蜜丸，以枣糕和汤服","cat1":"其他","symptom":"咳、喘、吐黏稠痰但坐、不得眠急慢性咳喘病"},
{"id":"112","name":"泻心汤","formula":"大黄12克，黄连6克，黄芩6克","cat1":"泻心汤证","symptom":"心悸、心烦、吐血、衄血、大便干不安、热证、高血压病"},
{"id":"113","name":"大黄汤 / 大黄丸","formula":"黄连3克，黄芩3克，栀子3克，大黄3克","cat1":"泻心汤证+栀子豉汤证","symptom":"心下痞满、心烦(++)、大便难不安、热象(++)、高血压病"},
{"id":"114","name":"大黄黄连泻心汤","formula":"大黄9克，黄连5克","cat1":"泻心汤证","symptom":"心下痞按之不硬、心烦、关上浮"},
{"id":"115","name":"附子泻心汤","formula":"大黄6克，黄连3克，黄芩3克，附子3克","cat1":"泻心汤证","symptom":"恶寒、汗(+)、心下痞寒热错杂"},
{"id":"116","name":"大黄硝石汤","formula":"大黄12克，黄柏12克，栀子9克，硝石12克（分二煎）","cat1":"其他","symptom":"、汗(+)、腹满小便黄、小便少、大便干、黄疸实热、急慢性肝胆病"},
{"id":"117","name":"茵陈蒿汤","formula":"茵陈蒿24克，栀子9克，大黄6克","cat1":"其他","symptom":"发热、头汗(+)、身汗(-)、烦躁小便不利、大便干、黄疸(阳黄)口渴(+)热与湿瘀、急性黄疸性肝炎"},
{"id":"118","name":"栀子大黄汤","formula":"栀子9克，大黄6克，枳实9克，香豉18克","cat1":"栀子豉汤证","symptom":"发热胸中窒塞、心烦(++)、腹胀满、大便难、黄疸不得眠阳明里实、胃肠炎、肝胆病"},
{"id":"119","name":"瓜蒂散","formula":"瓜蒂、赤小豆各等分，香豉汁和散","cat1":"其他","symptom":"胸脘满闷、欲吐不能吐、胃家实、邪实在上阳明病"},
{"id":"120","name":"一物瓜蒂汤","formula":"瓜蒂20个","cat1":"其他","symptom":"发热身痛、身重、微弱、暑热湿、夏季伤于冷水"},
{"id":"121","name":"甘草干姜汤","formula":"炙甘草18克，干姜9克","cat1":"甘草干姜汤证","symptom":"头晕、呕(+)、吐涎沫、遗尿、小便数口渴(-)胃虚寒"},
{"id":"122","name":"理中汤 / 理中丸","formula":"人参9克，炙甘草9克，白朮9克，干姜9克","cat1":"甘草干姜汤证","symptom":"头晕、心下痞、呕(+)、吐涎沫、小便不利、大便溏泻、口渴(-)胃虚寒"},
{"id":"123","name":"大建中汤","formula":"蜀椒9克，干姜18克，人参9克，胶饴1杯（分冲）","cat1":"其他","symptom":"心腹痛(++)、肠蠕动(++)、呕(+)、不能食、虚寒、蛔虫"},
{"id":"124","name":"吴茱萸汤","formula":"吴茱萸15克，人参9克，生姜18克，大枣4枚","cat1":"其他","symptom":"发热(-)头痛(++)、头晕、胸闷、烦躁(++)、吐涎沫、呕(+)、手足厥冷胃虚寒、胃肠、头脑诸疾、美尼尔氏综合征、偏头痛、青光眼"},
{"id":"125","name":"薯蓣丸","formula":"薯蓣9克，当归3克，桂枝3克，曲3克，干地黄3克，大豆黄卷3克，甘草6克，人参2.1克，川芎1.8克，芍药1.8克，白朮1.8克，麦冬1.8克，杏仁1.8克，柴胡1.5克，桔梗1.5克，茯苓1.5克， 阿胶2.1克，干姜0.9克，白蔹0.6克， 防风1.8克，大枣100枚  (为膏)，蜜丸","cat1":"其他","symptom":"气血不足、各种慢性虚劳病"},
{"id":"126","name":"干姜附子汤","formula":"干姜9克，附子（生用）9克","cat1":"其他","symptom":"发热(-)、恶寒(-)白天烦躁、呕(-)、手足厥冷、身冷口渴(-)、夜晚安静沉微、虚寒(++)"},
{"id":"127","name":"四逆汤","formula":"炙甘草9克，干姜8克，附子（生用）6克","cat1":"甘草干姜汤证+干姜附子汤证","symptom":"发热身痛、白天烦躁、呕(+)、小便利、下利清谷、手足厥冷、身冷口渴(-)、夜晚安静微微欲绝、津液伤(++)、虚寒(++)"},
{"id":"128","name":"通脉四逆汤","formula":"炙甘草9克，附子（生用）8克，干姜14克（强人可增为18克）","cat1":"四逆汤证","symptom":"发热、恶寒(-)、汗(+)、身痛、白天烦躁、腹痛、咽痛、呕(+)、小便利、下利清谷、手足厥冷、身冷、面赤口渴(-)、夜晚安静微微欲绝、虚寒(+++)"},
{"id":"129","name":"通脉四逆加猪胆汁汤","formula":"炙甘草9克，附子（生用）8克，干姜14克，猪胆汁1小勺(无猪胆以羊胆代之)","cat1":"通脉四逆汤证","symptom":"汗(+)、四肢拘急、呕(-)下利(-)、手足厥冷、微微欲绝、脉不出、病重、病危、心衰(++)"},
{"id":"130","name":"四逆加人参汤","formula":"炙甘草9克，干姜8克，附子（生用）6克，人参5克","cat1":"四逆汤证","symptom":"发热、恶寒身痛、白天烦躁、呕(+)下利、手足厥冷、身冷口渴(-)、夜晚安静微弱、津血虚(++)、虚寒(++)、胃气虚"},
{"id":"131","name":"茯苓四逆汤","formula":"茯苓12克，人参3克，附子（生用）3克，炙甘草5克，干姜8克","cat1":"四逆加人参汤证","symptom":"发热、恶寒身痛、烦躁、心下悸、呕(+)、小便不利、下利、手足厥冷、身冷口渴(-)、微弱、津血虚(++)、虚寒(++)、胃气虚"},
{"id":"132","name":"白通汤","formula":"葱白三茎，干姜5克，附子（生用）5克","cat1":"其他","symptom":"、下利但欲寐微细"},
{"id":"133","name":"乌梅丸","formula":"乌梅300枚，细辛48克，干姜90克，黄连134克，当归42克，炮附子48克，蜀椒42克，桂枝48克，人参48克，黄柏48克","cat1":"其他","symptom":"烦躁、腹痛、呕(+)下利、手足厥冷上热下寒、寒热错杂、胆囊炎、胆道蛔虫症、慢性肠炎"},
{"id":"134","name":"附子汤","formula":"附子（炮）6克，茯苓9克，人参6克，白朮12克，芍药9克","cat1":"附子汤证","symptom":"背恶寒关节疼痛、下肢拘急痛、屈伸不利、沉、胃虚、寒饮"},
{"id":"135","name":"真武汤","formula":"茯苓9克，芍药9克，生姜9克，白朮9克，炮附子3克","cat1":"附子汤证","symptom":"发热头晕、心悸、腹痛、心下痞(-)、四肢沉重疼痛、身体微动、呕(+)、小便不利、下利、下肢萎弱、麻痹、浮肿、沉、胃虚、寒饮"},
{"id":"136","name":"附子粳米汤","formula":"炮附子5克，粳米15克，半夏12克，炙甘草3克，大枣4枚","cat1":"其他","symptom":"下腹痛(++)、肠鸣(++)、呕(+)、虚寒、寒饮"},
{"id":"137","name":"赤丸方","formula":"茯苓12克，半夏12克，乌头（炮）6克，细辛3克","cat1":"其他","symptom":"腹痛寒证"},
{"id":"138","name":"大乌头煎","formula":"乌头大者5枚（去皮），蜜煎","cat1":"大乌头煎证","symptom":"恶寒、汗(+)、腹痛、寒疝、不欲饮食、手足厥冷、沉弦、寒证"},
{"id":"139","name":"乌头桂枝汤","formula":"乌头大者5枚，蜜煎，桂枝汤半杯","cat1":"大乌头煎证+桂枝汤证","symptom":"恶寒、汗(+)、身痛、关节痛(++)、腹痛、寒疝、不欲饮食、手足厥冷、沉弦、寒证(++)"},
{"id":"140","name":"乌头汤","formula":"麻黄9克，芍药9克，黄耆9克，炙甘草9克，乌头大者5枚，蜜煎","cat1":"大乌头煎证","symptom":"关节痛(++)、屈伸不利手足厥冷里寒外邪"},
{"id":"141","name":"乌头赤石脂丸","formula":"蜀椒0.6克，附子0.3克(炮)，干姜0.3克，赤石脂0.6克，乌头0.3克(炮)","cat1":"其他","symptom":"心痛(++)、背痛(++)虚寒(++)"},
{"id":"142","name":"栝楼瞿麦丸","formula":"栝楼根6克，茯苓10克，薯蓣10克，附子15克(炮），瞿麦3克","cat1":"金匮肾气丸证","symptom":"小便不利下肢肿口渴(++)、沉、虚寒、腹水"},
{"id":"143","name":"天雄散","formula":"天雄10克(炮)，白朮24 克，桂枝18克，龙骨10克，酒服","cat1":"其他","symptom":"头晕、气上冲、失精小便不利虚寒"},
{"id":"144","name":"头风摩散","formula":"大附子1枚(炮)，盐等分","cat1":"其他","symptom":"偏头痛"},
{"id":"145","name":"赤石脂禹余粮汤","formula":"赤石脂48克，禹余粮48克","cat1":"其他","symptom":"长期下利、虚寒"},
{"id":"146","name":"桃花汤","formula":"赤石脂24克，干姜3克，粳米15克","cat1":"其他","symptom":"腹痛小便不利、长期下利、脓血便、虚寒"},
{"id":"147","name":"大黄附子汤","formula":"大黄9克，炮附子9克，细辛6克","cat1":"其他","symptom":"发热胁下痛、身体偏侧疼痛、寒疝、腹痛、紧弦、寒湿、宜用下法者"},
{"id":"148","name":"走马汤","formula":"巴豆1枚（去皮心，熬去油），杏仁2枚","cat1":"其他","symptom":"胃腹痛(++)、大便不通、寒证、卒病暴疾胀满闭塞急救方"},
{"id":"149","name":"三物备急丸","formula":"大黄9克，干姜9克，巴豆（去皮心，熬，外研如脂）","cat1":"其他","symptom":"急性心腹胀痛呼吸急迫、口噤不开、假死寒实"},
{"id":"150","name":"桔梗白散","formula":"桔梗9克，贝母9克，巴豆3克","cat1":"其他","symptom":"胸满、胸痛、咽痛、咳、吐脓浊寒实"},
{"id":"151","name":"小柴胡汤","formula":"柴胡24克，黄芩9克，人参9克，半夏12克，炙甘草9克，生姜9克，大枣（擘）4枚","cat1":"小柴胡汤证","symptom":"寒热交替出现胸胁满(++)、心烦、头晕、呕(+)、不欲饮食、口苦草褥热头痛、咽干(+)、精神郁闷常默默然浮涩沉弦"},
{"id":"152","name":"小柴胡加生石膏汤","formula":"柴胡24克，黄芩9克，人参9克，半夏12克，炙甘草9克，生姜9克，大枣（擘）4枚 ，生石膏45-90克","cat1":"小柴胡汤证","symptom":"发热、汗(+)、头痛、胸胁满(++)、心烦、头晕、喘、呕(+)、不欲饮食、口苦、咽干(+)、口干(+)、精神郁闷常默默然、肺炎"},
{"id":"153","name":"小柴胡加桔梗汤","formula":"柴胡24克，黄芩9克，人参9克，半夏12克，炙甘草9克，生姜9克，大枣（擘）4枚 ，桔梗10克(口舌干燥加生石膏)","cat1":"小柴胡汤证","symptom":"寒热交替出现胸胁满(++)、心烦、头晕、咽痛、排痰困难、呕(+)、不欲饮食、口苦、咽干(+)、精神郁闷常默默然"},
{"id":"154","name":"小柴胡加橘皮汤","formula":"柴胡24克，黄芩9克，人参9克，半夏12克，炙甘草9克，生姜9克，大枣（擘）4枚，橘皮12-24克(口舌干燥加生石膏，排痰困难加桔梗)","cat1":"小柴胡汤证","symptom":"寒热交替出现胸胁满(++)、心烦、头晕、干咳(++)、呕(++)、不欲饮食、口苦、咽干(+)、精神郁闷常默默然"},
{"id":"155","name":"小柴胡加芍药汤","formula":"柴胡24克，黄芩9克，人参9克，半夏12克，炙甘草9克，生姜9克，大枣（擘）4枚，芍药10-18克","cat1":"小柴胡汤证","symptom":"寒热交替出现胸胁满(++)、心烦、头晕、腹挛痛、呕(+)、不欲饮食、口苦、咽干(+)、精神郁闷常默默然"},
{"id":"156","name":"小柴胡加吴茱萸汤","formula":"柴胡24克，黄芩9克，人参9克，半夏12克，炙甘草9克，生姜9克，大枣（擘）4枚，吴茱萸10克","cat1":"小柴胡汤证+吴茱萸汤证","symptom":"寒热交替出现胸胁满(++)、烦躁(++)、头痛、头晕、呕(+)、不欲饮食、口苦、吐涎沫、手足厥冷咽干(+)、精神郁闷常默默然、胃肠、头脑诸疾、胃虚寒"},
{"id":"157","name":"小柴胡加苓朮汤","formula":"柴胡24克，黄芩9克，人参9克，半夏12克，炙甘草9克，生姜9克，大枣（擘）4枚，茯苓10克，苍朮10克","cat1":"小柴胡汤证","symptom":"寒热交替出现胸胁满(++)、心烦、头晕、呕(+)、不欲饮食、口苦、小便不利、大便溏泻、浮肿咽干(+)、精神郁闷常默默然"},
{"id":"158","name":"小柴胡加丹参茵陈汤","formula":"柴胡24克，黄芩9克，人参9克，半夏12克，炙甘草9克，生姜9克，大枣（擘）4枚，丹参15-30克，茵陈18克","cat1":"小柴胡汤证","symptom":"寒热交替出现胸胁满(++)、心烦、头晕、呕(+)、不欲饮食、口苦、小便黄赤咽干(+)、精神郁闷常默默然、肝炎"},
{"id":"159","name":"柴胡加芒硝汤","formula":"柴胡24克，黄芩9克，人参9克，半夏12克，炙甘草9克，生姜9克，大枣（擘）4枚，芒硝12克","cat1":"小柴胡汤证","symptom":"寒热交替出现胸胁满(++)、心烦、头晕、呕(+)、不欲饮食、口苦大便难、咽干(+)、精神郁闷常默默然、里热"},
{"id":"160","name":"柴胡去半夏加栝楼汤","formula":"柴胡24克，人参9克，黄芩9克，生姜9克，大枣4枚，炙甘草6克，栝楼根12克","cat1":"小柴胡汤证","symptom":"寒热交替出现胸胁满(++)、心烦、头晕、呕(-)、不欲饮食、口苦、咽干(+)、口渴(++)、精神郁闷常默默然、困倦乏力"},
{"id":"161","name":"柴胡桂枝干姜汤","formula":"柴胡24克，桂枝10克，干姜6克，花粉12克，黄芩l0克，牡蛎10克，炙甘草6克","cat1":"柴胡去半夏加栝楼汤证","symptom":"寒热交替出现、头汗(+)、气上冲、胸胁满、心下微结、心烦、头晕、呕(-)、不欲饮食、口苦、小便不利手足厥冷咽干(+)、口渴(++)、精神郁闷常默默然、困倦乏力、寒多热微、或但寒不热、偏和解半表半里、袪寒饮"},
{"id":"162","name":"柴胡桂枝汤 / 柴胡桂枝各半汤","formula":"柴胡12克，半夏10克，黄芩5克，人参5克，桂枝5克、芍药5克、生姜5克，大枣3枚，炙甘草3克","cat1":"桂枝汤证+小柴胡汤证","symptom":"寒热交替出现关节痛(++)、胸胁满、呕(+)、急性风湿性关节炎"},
{"id":"163","name":"大柴胡汤","formula":"柴胡24克，黄芩10克，芍药10克，半夏12克，生姜12克，枳实12克，大枣4枚，大黄6克","cat1":"小柴胡汤证","symptom":"寒热交替出现心下痞硬满痛、胸胁满(++)、心烦、头晕、呕(+)、不欲饮食、口苦大便难、咽干(+)、精神郁闷常默默然、里实"},
{"id":"164","name":"柴胡加龙骨牡蛎汤","formula":"柴胡12克，龙骨3克，黄芩3克，生姜3克，铅丹3克，人参3克，桂枝3克，茯苓3克，半夏10克，大黄6克，牡蛎5克，大枣2枚","cat1":"小柴胡汤证","symptom":"寒热交替出现气上冲、心悸、胸胁满(++)、心烦、头晕、呕(+)、不欲饮食、口苦、小便不利、大便不畅、咽干(+)、易惊、不安、谵语、精神不安、狂痫病"},
{"id":"165","name":"四逆散","formula":"柴胡10克，芍药10克，枳实10克，炙甘草10克","cat1":"大柴胡汤证","symptom":"胸胁满(++)、腹痛、咳、心悸、呕(-)、小便不利、大便溏泻、手足厥冷热壅气郁、血行受阻"},
{"id":"166","name":"小半夏汤","formula":"半夏15克，生姜12克","cat1":"小半夏汤证","symptom":"头痛、眉棱骨痛、呕(+)、食不得下、小便不多、不红赤、欲自利黄疸口渴(-)胃中有水饮、新病寒轻"},
{"id":"167","name":"生姜半夏汤","formula":"半夏15克，生姜汁1杯","cat1":"小半夏汤证","symptom":"似喘不喘、心中闷乱无奈何、呕(++)、似呕不呕、口渴(-)痰饮(++)"},
{"id":"168","name":"小半夏加茯苓汤","formula":"半夏15克，生姜12克，茯苓10克","cat1":"小半夏汤证","symptom":"心悸、头晕、心下痞、呕(+)、口渴(+)胃中有水饮"},
{"id":"169","name":"半夏干姜散","formula":"半夏、干姜各等分","cat1":"小半夏汤证","symptom":"吐涎沫、干呕(+)、胃中有寒饮、胃虚寒、久病寒重"},
{"id":"170","name":"大半夏汤","formula":"半夏18克，人参10克，白蜜15克","cat1":"其他","symptom":"心下痞、食后则吐(+)、胃虚有水饮、宿食不化"},
{"id":"171","name":"干姜半夏人参丸","formula":"干姜10克，人参10克，半夏18克","cat1":"小半夏汤证+半夏干姜散证","symptom":"心下痞硬、呕(++)妊振恶阻"},
{"id":"172","name":"厚朴生姜半夏甘草人参汤","formula":"厚朴24克，生姜24克，半夏15克，炙甘草6克，人参3克","cat1":"生姜半夏汤证","symptom":"腹胀满、呕(++)、口渴(-)中气虚、痰饮盛"},
{"id":"173","name":"半夏厚朴汤","formula":"半夏12克，厚朴10克，茯苓12克，生姜12克，干苏叶6克","cat1":"小半夏加茯苓汤证","symptom":"梅核气、胸满、咽堵、咳、呕(+)、口渴(+)痰饮气结、神经症、胃病、慢性虚寒性咳嗽"},
{"id":"174","name":"旋覆代赭汤","formula":"旋覆花10克（包），人参6克，生姜15克，代赭石3克，炙甘草10克，半夏15克，大枣4枚","cat1":"其他","symptom":"心下痞、呕(+)、打嗝大便不畅、胃虚有饮、气逆不降"},
{"id":"175","name":"泽漆汤","formula":"半夏12克，紫参12克，泽漆60克，炙甘草6克，生姜12克，白前12克，黄芩6克，桂枝6克，人参6克","cat1":"其他","symptom":"发热(-)、恶寒(-)咳、喘、吐黄痰浮肿口渴(+)痰饮、热多"},
{"id":"176","name":"苦酒汤","formula":"半夏14枚，鸡子1枚（去黄），苦酒适量","cat1":"其他","symptom":"发热(-)、恶寒(-)咽痛、声哑、咽中生疮咽干(+)外感病后或多语所致"},
{"id":"177","name":"橘皮汤","formula":"橘皮12克，生姜24克","cat1":"橘皮汤证","symptom":"、干呕(+)、食欲不佳、手足厥冷病短、病轻适用"},
{"id":"178","name":"橘皮枳实生姜汤","formula":"橘皮50克，枳实10克，生姜24克","cat1":"橘皮汤证","symptom":"胸闷(++)、胸痹(++)、短气(++)、干呕(+)、食欲不佳、手足厥冷气壅饮逆"},
{"id":"179","name":"橘皮竹茹汤","formula":"橘皮90克，竹茹15克，大枣10枚，甘草15克，人参3克，生姜24克","cat1":"其他","symptom":"咳、干呕(++)、食欲不佳、手足厥冷胃虚"},
{"id":"180","name":"外台茯苓饮","formula":"茯苓10克，人参10克，白朮10克，枳壳6克，橘皮10克，生姜12克","cat1":"橘皮枳实生姜汤证","symptom":"胸满、心下痞、腹胀、呕吐水(+)、打嗝、食欲不佳、小便不利、大便溏泻、手足厥冷胃中水饮"},
{"id":"181","name":"黄芩汤","formula":"黄芩10克，炙甘草6克，芍药6克，大枣4枚","cat1":"黄芩汤证","symptom":"发热腹痛、下利、急性肠胃炎、急性痢疾"},
{"id":"182","name":"黄芩加半夏生姜汤","formula":"黄芩10克，炙甘草6克，芍药6克，大枣4枚，半夏12克，生姜l0克","cat1":"黄芩汤证+小半夏汤证","symptom":"发热腹痛、呕(++)、恶心(++)下利、胃肠炎、胆囊炎"},
{"id":"183","name":"六物黄芩汤 / 外台黄芩汤","formula":"黄芩10克，人参10克，干姜10克，大枣4枚，桂枝3克，半夏12克","cat1":"黄芩加半夏生姜汤证","symptom":"心下痞硬、干呕(+)下利、手足厥冷上热下寒、偏寒"},
{"id":"184","name":"三物黄芩汤","formula":"黄芩10克，苦参10克，生地18克","cat1":"其他","symptom":"心烦、头痛(-)手足心热、草褥热、里热、血热、胃虚(-)"},
{"id":"185","name":"黄连汤","formula":"黄连10克，炙甘草10克，干姜10克，桂枝6克，人参6克，半夏12克，大枣4枚","cat1":"六物黄芩汤证","symptom":"心烦(++)、心悸(++)、心下痞满、腹痛、干呕(+)下利、胸中有热、胃中有水气"},
{"id":"186","name":"黄连阿胶汤","formula":"黄连12克，黄芩6克，芍药6克，阿胶10克，鸡子黄1枚","cat1":"其他","symptom":"虚烦、心悸、下利、脓血便、手足心热、失血不得眠半表半里、里热、血虚血热"},
{"id":"187","name":"白头翁汤","formula":"白头翁10克，黄连10克，黄柏10克，秦皮10克","cat1":"白头翁汤证","symptom":"腹痛、下利、里急后重、欲饮水内热、急性肠炎、痢疾"},
{"id":"188","name":"白头翁加甘草阿胶汤","formula":"白头翁10克，黄连10克，黄柏10克，秦皮10克，甘草6克，阿胶6克","cat1":"白头翁汤证","symptom":"腹痛、下利、里急后重、血便、粘血便产后、欲饮水、疲乏少气、内热、急性肠炎、痢疾"},
{"id":"189","name":"干姜黄连黄芩人参汤","formula":"干姜10克，黄连10克，黄芩10克，人参10克","cat1":"其他","symptom":"胸中烦热、心下痞硬、呕(+)、食后则吐(+)大便溏泻、上热下寒"},
{"id":"190","name":"半夏泻心汤","formula":"半夏12克，黄芩10克，干姜10克，炙甘草10克，人参10克，黄连3克，大枣4枚","cat1":"半夏泻心汤证","symptom":"心下痞硬、肠鸣、呕(+)、上热下寒、急慢性胃肠炎、肠功能紊乱"},
{"id":"191","name":"甘草泻心汤","formula":"半夏12克，炙甘草15克，人参10克，黄芩10克，黄连3克，干姜10克，大枣4枚","cat1":"半夏泻心汤证","symptom":"心下痞、肠鸣、呕(+)下利、口舌糜烂、前后阴溃疡上热下寒、中气虚(++)"},
{"id":"192","name":"生姜泻心汤","formula":"生姜12克，炙甘草10克，人参10克，干姜3克，黄芩10克，半夏12克，黄连3克，大枣4枚","cat1":"半夏泻心汤证","symptom":"心下痞满、肠鸣(++)、干呕(++)、吞酸嘈杂下利(++)、上热下寒、胃中寒饮(++)、胃下垂、胃扩张、胃酸过多、胃肠炎"},
{"id":"193","name":"栀子豉汤","formula":"栀子10克，香豉18克","cat1":"栀子豉汤证","symptom":"发热胸中窒塞、心烦(++)、大便溏泻(-)、不得眠胃胸里热、急性病后期或慢性病见胃胸疾病"},
{"id":"194","name":"栀子甘草豉汤","formula":"栀子10克，香豉18克，炙甘草6克","cat1":"栀子豉汤证","symptom":"发热胸中窒塞、心烦(++)、大便溏泻(-)虚祛少气、不得眠胃胸里热、急性病后期或慢性病见胃胸疾病"},
{"id":"195","name":"栀子生姜豉汤","formula":"栀子10克，香豉18克，生姜15克","cat1":"栀子豉汤证","symptom":"发热胸中窒塞、心烦(++)、呕(+)大便溏泻(-)、不得眠胃、食道病变"},
{"id":"196","name":"枳实栀子豉汤","formula":"炒枳实10克，栀子10克，香豉18克，有宿食、大便不通加大黄","cat1":"栀子豉汤证","symptom":"发热胸中窒塞、心烦(++)、心下胀满、大便溏泻(-)、不得眠热证、胃肠疾病"},
{"id":"197","name":"栀子厚朴汤","formula":"栀子10克，炙厚朴12克，炙枳实10克","cat1":"其他","symptom":"心烦、腹胀满卧起不安虚满、热证"},
{"id":"198","name":"栀子柏皮汤","formula":"栀子10克，炙甘草3克，黄柏6克","cat1":"其他","symptom":"发热心烦黄疸不可攻下"},
{"id":"199","name":"栀子干姜汤","formula":"栀子10克，干姜6克","cat1":"栀子豉汤证","symptom":"发热心烦、呕(+)下利(+)、上热下寒、误治或慢性胃肠病"},
{"id":"200","name":"甘草汤","formula":"甘草18克","cat1":"甘草汤证","symptom":"咽痛"},
{"id":"201","name":"桔梗汤","formula":"桔梗10克，甘草18克","cat1":"甘草汤证","symptom":"咽痛(++)、胸胁痛、咳、吐浓痰肺痈、肝炎肝区痛"},
{"id":"202","name":"芍药甘草汤","formula":"芍药18克，炙甘草18克","cat1":"芍药甘草汤证","symptom":"四肢挛急疼痛、胃腹挛急疼痛脚弱无力、行步困难"},
{"id":"203","name":"芍药甘草附子汤","formula":"芍药10克，炙甘草10克，附子3克","cat1":"芍药甘草汤证","symptom":"恶寒四肢挛急疼痛、胃腹挛急疼痛阳虚寒"},
{"id":"204","name":"甘草小麦大枣汤","formula":"甘草27克，小麦30克，大枣10枚","cat1":"其他","symptom":"呵欠(++)、无故哭笑难以自控、津血虚、脏腑失养"},
{"id":"205","name":"甘草粉蜜汤","formula":"甘草18克，粉10克，蜂蜜36克 (得去铅粉，加白芨10克)","cat1":"其他","symptom":"胃脘痛(++)、胀满(-)蛔虫病、溃疡病"},
{"id":"206","name":"生姜甘草汤","formula":"生姜15克，人参10克，甘草12克，大枣5枚","cat1":"其他","symptom":"咳、吐白痰、呕(+)、食欲不佳、咽干(+)、口渴(+)胃虚、水饮、肺痿"},
{"id":"207","name":"排脓汤","formula":"甘草10克，桔梗14克，生姜5克，大枣5枚","cat1":"桔梗汤证","symptom":"咳、吐浊痰、胸痛久病、急性阑尾炎脓已成"},
{"id":"208","name":"枳朮汤","formula":"枳实20克，白朮18克","cat1":"其他","symptom":"心下坚满边界清楚小便不利水饮"},
{"id":"209","name":"枳实芍药散","formula":"炒枳实l0-12克，芍药l0-12克","cat1":"枳实芍药散证","symptom":"腹满挛痛、心烦、产后不安"},
{"id":"210","name":"排脓散","formula":"炒枳实10克，芍药10克，桔梗3克，鸡子黄1枚","cat1":"枳实芍药散证","symptom":"腹满挛痛、心烦痈脓、产后不安、急性阑尾炎脓已成"},
{"id":"211","name":"桂枝生姜枳实汤","formula":"桂枝10克，生姜10克，枳实15克","cat1":"其他","symptom":"心下痞塞、胸胁闷痛心绞痛"},
{"id":"212","name":"栝楼薤白白酒汤","formula":"栝楼实1枚（捣），薤白72克，白酒7杯(得以黄酒代)","cat1":"栝楼薤白白酒汤证","symptom":"胸闷、胸背痛、短气、喘、寸沉迟、关上小紧弦、痰饮阻滞、哮喘、胸膜炎、冠心病"},
{"id":"213","name":"栝楼薤白半夏汤","formula":"栝楼实1枚（捣），薤白27克，半夏72克，白酒10杯(得以黄酒代)","cat1":"栝楼薤白白酒汤证","symptom":"胸闷、心痛(++)、咳(++)、短气(++)不得卧冠心病、心绞痛、胸膜炎"},
{"id":"214","name":"枳实薤白桂枝汤","formula":"枳实12克，厚朴12克，薤白24克，桂枝3克，栝楼30克","cat1":"栝楼薤白白酒汤证","symptom":"胸闷、胸背痛、胸腹胀满(++)、短气、喘、寸沉迟、关上小紧弦、哮喘、胸膜炎、冠心病、痰饮阻滞"},
{"id":"215","name":"芎归胶艾汤","formula":"川芎6克，阿胶6克，甘草6克，艾叶10克，当归10克，芍药12克，干地黄18克","cat1":"其他","symptom":"腹痛失血虚证"},
{"id":"216","name":"当归芍药散","formula":"当归10克，川芎10克，茯苓12克，白各12克，泽泻24克，芍药48克","cat1":"当归芍药散证","symptom":"腹痛(++)、腹拘急、头晕、心悸小便不利血虚、血瘀、虚寒、痰饮"},
{"id":"217","name":"温经汤","formula":"吴茱萸10克，当归6克，川芎6克，芍药6克，人参6克，桂枝6克，阿胶6克，牡丹皮6克，生姜6克，甘草6克，半夏10克，麦门冬18克","cat1":"芎归胶艾汤证+当归芍药散证+吴茱萸汤证+桂枝茯苓丸证+麦门冬汤证","symptom":"傍晚发热头痛、头晕、胸闷、心悸、腹满痛、呕(+)、口唇干燥、手足热、崩漏、流产、月经不调、久不受孕、咽干(+)津血不足、胃虚寒、瘀血"},
{"id":"218","name":"当归散","formula":"当归30克，黄芩30克，芍药30克，川芎30克，白朮15克","cat1":"当归芍药散证","symptom":"发热腹痛、心烦、妊娠、血虚有热"},
{"id":"219","name":"当归四逆汤","formula":"当归10克，桂枝10克，芍药10克，细辛l0克，炙甘草6克，通草6克，大枣8枚","cat1":"桂枝汤证","symptom":"、呕(-)下利(-)、手足凉、细欲绝、外寒、冻疮"},
{"id":"220","name":"当归四逆加吴茱萸生姜汤","formula":"当归10克，桂枝10克，芍药10克，细辛10克，炙甘草6克，通草6克，大枣8枚，吴茱萸30克，生姜24克","cat1":"当归四逆汤证","symptom":"头痛、心腹痛、呕(+)、手足凉长期内寒、冻疮"},
{"id":"221","name":"当归生姜羊肉汤","formula":"当归10克，生姜15克，羊肉50克","cat1":"其他","symptom":"腹痛(++)、胁痛、疝气、产后、血虚、虚寒"},
{"id":"222","name":"赤小豆当归散","formula":"赤小豆90克（浸令发芽，曝干），当归24克","cat1":"其他","symptom":"、大便近血、痔疮、诸疮有痈、脓、恶血肛门病、泌尿系病、皮肤病"},
{"id":"223","name":"黄土汤","formula":"甘草10克，干地黄10克，白朮10克，炮附子10克，阿胶10克，黄芩10克，灶中黄土24克","cat1":"其他","symptom":"心烦、四肢疼痛麻木、大便溏泻(+)、黑紫远血、手足厥冷、吐血、衂血、微、血虚、寒热错杂"},
{"id":"224","name":"八味丸 / 肾气丸","formula":"干地黄24克，山萸肉12克，山药12克，茯苓10克，丹皮10克，泽泻10克，桂枝3克，炮附子3克","cat1":"其他","symptom":"小腹麻痹拘急、腰膝酸软疼痛、心烦、阳痿、食欲不佳(-)、小便不利、小便失禁、子宫下垂、带下、口渴(+)下焦虚、瘀血水毒陷于阴"},
{"id":"225","name":"炙甘草汤","formula":"炙甘草12克，生姜10克，人参6克，桂枝l0克，生地50克，阿胶6克，麦门冬15克，麻仁12克，大枣10枚 ，对入黄酒20-30毫升","cat1":"其他","symptom":"心动悸、结代、气阴两虚、冠心病、心律失常、肺结核后期骨瘦如柴"},
{"id":"226","name":"酸枣仁汤","formula":"酸枣仁60克，甘草3克，知母6克，茯苓6克，川芎6克","cat1":"其他","symptom":"发热(-)心悸、心烦不得眠血虚"},
{"id":"227","name":"奔豚汤","formula":"甘草6克， 川芎6克，芍药6克 ， 当归6克，半夏12克， 黄芩6克 ，生葛根15克， 生姜12克，甘李根白皮15克","cat1":"其他","symptom":"寒热交替出现气上冲(++)、腹痛血虚、水饮、热证(++)"},
{"id":"228","name":"麦门冬汤","formula":"麦门冬30克，半夏15克，人参6克，甘草6克，粳米10克，大枣4枚","cat1":"麦门冬汤证","symptom":"咳、喘、痰黏咽干(+)虚火挟痰、咳喘后期"},
{"id":"229","name":"竹叶石膏汤","formula":"竹叶10克，生石膏45-90克，半夏15克，麦门冬30克，人参10克，炙甘草6克，粳米15克","cat1":"麦门冬汤证","symptom":"发热心烦、呕(+)、口渴(+)、虚羸少气、急性热病、肺结核后期"},
{"id":"230","name":"木防己汤","formula":"木防己14克，生石膏40-90克，桂枝10克，人参18克","cat1":"木防己汤证","symptom":"长期喘满、心下痞坚、心烦、胸闷、心悸面色黧黑口渴(+)、沉紧、肺心病肝脾肿大症、心脏病"},
{"id":"231","name":"木防己去石膏加茯苓芒硝汤","formula":"木防己14克，桂枝10克，人参18克，茯苓18克，芒硝27克（分二煎用）","cat1":"木防己汤证","symptom":"长期喘满、心下痞坚(++)、心烦、胸闷、心悸小便不利、大便不畅、面色黧黑口渴(+)、沉紧、肺心病肝脾肿大症、心脏病"},
{"id":"232","name":"防己茯苓汤","formula":"防己l0克，黄耆10克，桂枝10克，茯苓18克，甘草6克","cat1":"其他","symptom":"恶风、汗(+)、四肢浮肿、四肢微动皮水"},
{"id":"233","name":"防己黄耆汤","formula":"防己10克，黄耆12克，炙甘草5克，白朮8克，生姜8克，大枣3枚","cat1":"其他","symptom":"恶风(++)、汗(+)、身重身肿、腰以下肿(++)、浮、风水"},
{"id":"234","name":"薏苡附子散","formula":"薏苡仁，炮附子各等分","cat1":"其他","symptom":"关节痛、胸痹疼痛时缓时急寒湿、胸痹、关节痛、湿疹、疮疡"},
{"id":"235","name":"薏苡附子败酱散","formula":"薏苡仁30克，附子6克，败酱15克","cat1":"其他","symptom":"发热(-)肠痈腹痛、腹胀满按之软、皮肤痒皮肤甲错、肿、流黄水、数、瘀血痈脓、皮炎、痂癞、急性阑尾炎脓已成"},
{"id":"236","name":"苇茎汤","formula":"苇茎30克，薏苡仁18克，桃仁10克，冬瓜仁15克","cat1":"其他","symptom":"发热咳、吐黄脓痰、心烦、胸闷肺痈有脓"},
{"id":"237","name":"猪苓汤","formula":"猪苓10克，茯苓10克，泽泻10克，滑石10克，阿胶10克","cat1":"利尿剂","symptom":"发热咳、心烦小便不利、淋痛、尿血、下利、口渴(+)、欲饮水不得眠、浮、湿热、泌尿系炎症"},
{"id":"238","name":"猪苓散","formula":"猪苓、茯苓、白朮各等分","cat1":"利尿剂","symptom":"、呕(+)、小便不利口渴(+)胃中水饮"},
{"id":"239","name":"泽泻汤","formula":"泽泻45克，白朮18克","cat1":"利尿剂","symptom":"头晕小便不利胃中水饮、内分泌失调、动脉硬化、高血压病"},
{"id":"240","name":"茯苓泽泻汤","formula":"茯苓24克，泽泻12克，甘草6克，桂枝6克，白朮l0克，生姜12克","cat1":"利尿剂","symptom":"、呕(+)、小便不利口渴(+)、欲饮水胃中水饮、急性肠胃炎、胃肠型感冒"},
{"id":"241","name":"甘草干姜茯苓白朮汤 / 肾着汤","formula":"甘草6克，白朮6克，干姜12克，茯苓12克","cat1":"甘草干姜汤证","symptom":"腰以下冷重疼痛、食欲不佳(-)、小便自利、遗尿水肿口渴(-)肾着"},
{"id":"242","name":"茯苓杏仁甘草汤","formula":"茯苓18克，杏仁12克，甘草6克","cat1":"其他","symptom":"胸闷、胸痹、短气、咳、喘小便不利气壅饮逆"},
{"id":"243","name":"牡蛎泽泻散","formula":"牡蛎、泽泻、蜀漆（暖水洗去腥）、海藻（洗去盐）、栝楼根、商陆根、葶苈子各等分","cat1":"利尿剂","symptom":"小便不利腰以下水肿口渴(+)不可多服久服"},
{"id":"244","name":"葵子茯苓散","formula":"葵子48克，茯苓10克","cat1":"其他","symptom":"恶寒头晕、身重小便不利浮肿、妊娠、不论男女泌尿系病"},
{"id":"245","name":"柏叶汤","formula":"柏叶10克，干姜10克，艾叶10克，马通汁(或黄土汁)煎","cat1":"其他","symptom":"心烦、腹痛吐血、衄血、下血、无力、寒证"},
{"id":"246","name":"蜀漆散","formula":"蜀漆（洗去腥）、云母（烧二日夜）、龙骨各等分，未发前以浆水服2克，温疟加蜀漆2克，临发时服3克","cat1":"其他","symptom":"寒热交替出现寒多热少、偏逐饮化痰、疟疾"},
{"id":"247","name":"栝楼牡蛎散","formula":"枯楼根、牡蛎（熬）等分","cat1":"其他","symptom":"胸腹动悸口渴(+)、不安、虚热"},
{"id":"248","name":"百合地黄汤","formula":"百合7枚，生地黄汁1杯","cat1":"百合证","symptom":"、口苦、小便赤、欲食复不能食、欲卧不能卧、欲行不能行、常默默微数、虚热、瘀血、百合病、精神失常症"},
{"id":"249","name":"百合鸡子汤","formula":"百合7枚(擘)，鸡子黄1枚","cat1":"百合证","symptom":"、欲食复不能食、欲卧不能卧、欲行不能行、常默默、虚热、胃虚弱、百合病、精神失常症"},
{"id":"250","name":"百合知母汤","formula":"百合7枚(擘)，知母10克","cat1":"百合证","symptom":"心烦、欲食复不能食、欲卧不能卧、欲行不能行、常默默、虚热、百合病、精神失常症"},
{"id":"251","name":"百合洗方","formula":"百合300克，外洗","cat1":"百合证","symptom":"口渴(+)、欲食复不能食、欲卧不能卧、欲行不能行、常默默、虚热、百合病、精神失常症"},
{"id":"252","name":"百合滑石散","formula":"百合10克(炙)，滑石30克","cat1":"百合证","symptom":"发热(++)、欲食复不能食、欲卧不能卧、欲行不能行、常默默、内热、百合病、精神失常症"},
{"id":"253","name":"滑石代赭汤","formula":"百合7枚(擘) ，滑石15克(碎，绵裹) ，代赭石15克(碎，绵裹)","cat1":"百合证","symptom":"、大便溏泻欲食复不能食、欲卧不能卧、欲行不能行、常默默、虚热、百合病、精神失常症"},
{"id":"254","name":"蒲灰散方","formula":"蒲灰2.1克，滑石0.9克","cat1":"利尿剂","symptom":"小便不利、小便赤涩、尿血热证"},
{"id":"255","name":"滑石白鱼散","formula":"滑石0.6克，乱发0.6克(烧)，白鱼0.6克","cat1":"利尿剂","symptom":"小便不利、小便赤涩、尿血热证"},
{"id":"256","name":"茯苓戎盐汤","formula":"茯苓24克， 白朮6克， 戎盐弹丸大1枚","cat1":"利尿剂","symptom":"心下悸小便淋沥不通热证"},
{"id":"257","name":"猪膏发煎","formula":"猪膏72克，乱发（如鸡子大）3枚","cat1":"利尿剂","symptom":"少腹满小便不利、大便干结常见、阴吹有声"},
{"id":"258","name":"文蛤散","formula":"文蛤","cat1":"其他","symptom":"口渴(++)、欲饮水"},
{"id":"259","name":"矾石汤","formula":"矾石18克，浸脚","cat1":"其他","symptom":"气上冲心脚气痿弱不仁"},
{"id":"260","name":"硝石矾石散","formula":"硝石、矾石(烧)等分","cat1":"其他","symptom":"身热(++)、恶寒少腹满、大便黑溏、黄疸、色黯黑瘀血轻、慢性肝硬化"},
{"id":"261","name":"蛇床子散","formula":"蛇床子仁，铅粉少许，坐药","cat1":"其他","symptom":"、阴部肿痛、瘙痒下白浊、寒湿、阴道滴虫、真菌性阴道炎"},
{"id":"262","name":"苦参汤","formula":"苦参50克，熏洗","cat1":"其他","symptom":"、阴部湿疮、溃疡、瘙痒、咽干(+)下有湿热"},
{"id":"263","name":"雄黄熏方","formula":"雄黄，熏","cat1":"其他","symptom":"肛门溃烂、湿疹湿热(++)"},
{"id":"264","name":"侯氏黑散","formula":"菊花12克，白朮3克，细辛0.9克，茯苓0.9克，牡蛎0.9克，桔梗2.4克，防风3克，人参0.9克，矾石0.9克，黄芩1.5克，当归0.9克，干姜0.9克，川芎0.9克，桂枝0.9克 ?","cat1":"其他","symptom":"肢体重着中风后、中虚有寒"},
{"id":"265","name":"肘后獭肝散","formula":"獭肝1具","cat1":"其他","symptom":"肺结核病"},
{"id":"266","name":"诃梨勒散","formula":"诃梨勒10枚(煨)","cat1":"其他","symptom":"咳、咽痛、下利、屁(++)、虚寒"},
{"id":"267","name":"鸡屎白散","formula":"鸡屎白","cat1":"其他","symptom":"转筋(++)"},
{"id":"268","name":"当归贝母苦参丸","formula":"当归12克，贝母12克，苦参12克","cat1":"其他","symptom":"、食欲不佳(-)、小便灼热、疼痛、淋沥、妊娠、尿道感染"},
{"id":"269","name":"狼牙汤","formula":"狼牙10克，坐洗","cat1":"其他","symptom":"外阴、阴道溃烂、滑数、实热"}
];



    callLater(successCallback);

}